
1 Заменяем папку main - на проект 
1 докере заменить на мой проект название там  где (main) (всё)
2 пекеджейсон заменить название там где  (main) (всё)
3 папку из theme-main переносим в 
  theme-мой проект содержимое  
   и удаляем  theme-main она больше не нужна



1 !!!!!!! запуск  docker compose up -d   (запускаем только 1 до того как перенесли из theme-main  в мой проект ) последуйщий раз проект запускаем
   из докера приложения(без команды) потому что удалит мой проект !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  
   !!!!!!! если юзаю команду когда пишу проект
   1 если работаю еще с одини проектом 
   2 или нужно ипользывать команду  docker compose up -d ( до этой команды все сохранить на гите (сохранить иформацию))

Запуск npm run dev 

и перезайти визуал стулио код 